{"Marilyn Manson_Heaven Upside Down": "No Review", "Marilyn Manson_The Pale Emperor": "No Review", "Marilyn Manson_The Pale Emperor (Deluxe)": "No Review", "Marilyn Manson_THE PALE EMPEROR (Deluxe Edition)": "No Review", "Marilyn Manson_THE PALE EMPEROR": "No Review", "Marilyn Manson_The Pale Emperor (Deluxe Version)": "No Review", "Marilyn Manson_Born Villain": "No Review", "Marilyn Manson_Slo-Mo-Tion (Remixes)": "No Review", "Radiohead_OK Computer OKNOTOK 1997 2017": "No Review", "Radiohead_A Moon Shaped Pool": "No Review", "Radiohead_TKOL RMX 1234567": "No Review", "Radiohead_The King Of Limbs": "No Review", "Radiohead_In Rainbows": "No Review", "Radiohead_In Rainbows (Disk 2)": "No Review", "Radiohead_Hail To the Thief": "No Review", "Radiohead_Amnesiac": "No Review", "Radiohead_I Might Be Wrong": "No Review", "Radiohead_Kid A": "No Review", "Radiohead_OK Computer": "No Review", "Radiohead_The Bends": "No Review", "Radiohead_Pablo Honey": "No Review", "Arcade Fire_Everything Now": "Arcade Fire became a new band for their 2013 album Reflektor, a prismatic, 75-minute carnival of genres about creating meaningful connections in a diffuse technological age. Before the album came out, they billed themselves as the Reflektors, with a fake website, a fake album, a bunch of secret shows, and some top-heavy papier-mâché masks. As this new band, they were reborn on the dance floor. No longer just po-faced helmet bangers and nostalgia merchants using Google Maps to make people cry, now they had synths and beats and a silver sparkle with James Murphy and Haitian kompa and rara music all celebrating with joie de vivre under the mirror ball.\nWho Arcade Fire became on their new album Everything Now—a tangled, joyless record of Banksy disco and bloodless new wave that examines fear, love, and suicide in our modern media landscape—is anyone’s guess. Before its release, they created a fake “global media and e-commerce platform” called Everything Now, a brand play that spawned Creature Comfort cereal, engaged with KFC’s Twitter account, and published “fake news” websites, one of which was a satirical review of the record in question. The aim of their online theatre, apparently, was to bolster some of the record’s themes of infinite consumerism in media, the overwhelming anxiety of the moment, the recursive loop of technology—sex, drugs, and Marshall McLuhan.\nIt would be one thing if the tiresome rollout ran contrary to its music—a bit of cosmic brain Twitter irony to temper another earnest Arcade Fire album. But Everything Now attempts to capture life within and without the content loop—the paranoia, narcissism, and “creature comforts” within; the love and fear without. It’s a worthy undertaking because this kind of acute despair feels more pervasive than ever. Things have changed since OK Computer asked and answered a lot of these questions. Now it’s not a dread that looms large, it’s a pronounced daily trauma, one self-inflicted by simply logging on and making yourself available as a marketing target.\nBut on Everything Now, Arcade Fire aren’t lifeboats for our ennui, they’re scolds. Their self-reflexive mood and half-baked critiques have landed all over the record’s grooves. The “society, man” songs are riddled with cliche, and the love songs are a bore. If ever you faulted Arcade Fire for their unmoored passion, their art-school busking aesthetic, their words lousy with import and meaning, you have to admit at least they sounded like they gave a shit. The charmless air of Everything Now captured by Arcade Fire’s six-person lineup—with the aid of Daft Punk’s Thomas Bangalter, Beak>’s Geoff Barrow, and Pulp bassist Steve Mackey, among others—creates an atmosphere of self-loathing and dim romance, housing two separate songs whose lyrics are “Infinite content/Infinite content/We’re infinitely content.” For a band who discovered themselves in sincerity, they are thoroughly lost when they bet it all on cynicism.\nNever mind that Win Butler—who once burst forth from the mix to holler from his heart, singing hallelujah—now just intones his words in this dry, accusatory tone. Never mind that he asks you if you “want to get messed up,” preaches at the pulpit about boys and girls who hate themselves, and then just raps all seven days of the week at one point. Never mind that the record falls off a cliff with the painful dub-synth disaster “Peter Pan,” a song so starchy and grooveless it seems impossible they could write anything worse. Never mind that they do write something worse with “Chemistry,” the sound of Billy Squier pouring warm milk over the concept of reggae.\nThese are all just bad omens on the way to realizing Everything Now is trapped in lyrical and musical stasis. Conceptually, the songs don’t transcend their social critique, they succumb to it. Musically, they don’t have momentum, they simply fight inertia. The warmer back half of the record is at war with itself, trying to pull real feelings up from arrangements that are topographically dull and looped out much longer than they need to be. “Put Your Money on Me” pulls off a neat melodic shift halfway through (cribbed from the chorus of “Dancing Queen”) but then runs out of ideas, relying instead on a tired synth bassline. It’s whiplash to go from the scrappy, orchestrated new wave-pop of “We Exist” to something this anemic, as if the only lesson they took from dance music is that songs should, above all, alternate between two chords.\nArcade Fire used to be goobers whose bombast and sanctimony were forgiven because their music was so dazzling. They made a simple blues progression seem like an ocean on “Keep the Car Running.” And live, I mean, to watch Richard Reed Perry go to war with a concert bass drum, or to watch Régine Chassagne stare transfixed as she sings of Haiti or to watch the entire band rev up a dance pit with “Here Comes the Night Time” is to see why they became iconoclasts 13 years ago, simply by giving so much space to people who didn’t care about being cool. Like U2 and Bruce Springsteen before them, Arcade Fire songs aren’t measured by their length or chart placement, they’re measured by their area, and how many people they gather to emote within it.\nBut here in the claustrophobic space of Everything Now, the warts of Arcade Fire are impossible to miss. Map the vocal melody on “No Cars Go” or “Sprawl II” with your finger in the air and you’ll arc it up and down in peaks and valleys. Do the same thing with the turgid and thoughtless “Creature Comfort” or “Peter Pan” or “Signs of Life” and your finger will barely move.  Butler’s commitment to the detached frontman where singing occurs barely or not at all robs songs of their emotional largesse, that basic thing we licensed to Arcade Fire and upon which their entire identity relies.\nWhat saving grace there is on Everything Now is scattered throughout its mercifully short 47 minutes. The title track, one last reverie before the darkness, shines much like its counterpart on Reflektor. Those unison strings and piano, that four-on-the-floor beat, the exalting choir behind the band, Patrick Bebey’s pygmy flute performance: it’s a treasure. Sure, the chorus is Win Butler getting wistful and bitter about how he, too, is allowed everything all of the time, but it’s upheld by the life of the music around it. Butler manages to fight through all his doubt on the touching finale “We Don’t Deserve Love,” a woozy, protracted sunrise, a full-band capitulation to feeling at end of a bleak, anti-celebratory album. These and the filigrees of Chassagne’s voice on the standout “Electric Blue”—specifically when it helixes up into the stratosphere near the end—are to be clung to and cherished as deeply human moments on a record desperately in need of them.\nWhich is to say that Everything Now succeeds in concept alone: It is an album about a once and possibly future great band trapped in its own feedback loop (the digital download is indeed sequenced for infinite content: the final track “Everything Now (Continued)” connects seamlessly with the intro “Everything_Now (Continued)”). But it belies to such a great degree what we’ve come to love about Arcade Fire in the first place. On “Creature Comfort,” Butler sings about someone attempting suicide while listening to Funeral. In the world of Everything Now, it works as this shocking, bemused moment of interconnectivity. The way he sings it—almost in passing—fits with the dazed and dead tone Butler conveys through his lyrics. But in the world outside the record, it’s callous and obnoxious, unpacked without grace or taste by a band who are historically committed to helping out those in need. Is this who they fear they’ll become, or is this who they have become? It’s a question the album fails to answer.\n", "Arcade Fire_Reflektor (Deluxe)": "No Review", "Arcade Fire_Reflektor": "It's likely that the first time you heard the Arcade Fire's monstrously anticipated fourth album Reflektor, you were—to borrow a phrase that Win Butler spits out like a bite of bad food during the record's disco-noir title track—\"staring at a screen.\" This past Thursday, the band posted to Youtube an 85-minute video which cued up the entirety of the double-album to visuals from Marcel Camus' kaleidoscopic 1959 film Black Orpheus. If something that happens on the internet can be considered An Event, then this certainly was one; in the same moment I saw the band's official tweet announcing it, two people simultaneously instant-messaged me the link. It was late afternoon on the East Coast, lunchtime on the West, and in that moment I did exactly what thousands of other people in those and all other time zones did: Stopped what I was doing, closed some extraneous tabs and programs, and listened. The auto-updating comments became a chronicle of knee-jerk first impressions: fervent gushing (\"The bassline on 'Joan of Arc' is fucking epic\"), groan-worthy puns (\"I can't even reflect how excited this makes me!\"), and egregious misspellings (\"I don't understand what all the fuzz is about\"). This scene would have seemed bizarre—and likely a little sad— to us decades ago, and it's frightening to imagine how quaint it will seem in the future. But this is how a lot of people at this moment in time—the one in which Reflektor was made, and the one it distrustfully interrogates—discover new music: Alone; together.\nAll four of the Montreal-based band's albums have been about the tension between those two words, taking up subjects like suburban isolation and the false community of religiosity, but Reflektor is larger, at least in scope, than anything Arcade Fire have done before. Of course, the stakes have been raised considerably since we've last heard from them: Their previous album, The Suburbs, was the unexpected winner of the Grammy for 2011's Album of the Year. And yet, no one involved in this record sounds to be resting on the laurels of their achievements—that includes producer and LCD Soundsystem retiree James Murphy. Reflektor is a triumph, but not a victory lap; the band never sounds content enough for that.\nThis is instead an anxious, occasionally downright paranoid album that asks big, barbed questions aimed not just at the man who may or may not be upstairs, but the more terrestrial gods of rock history, too. With either Ziggy Stardust, the Fly, or maybe that first guy who played Daft Punk to the rock kids as their guide, Arcade Fire have spiked their usual clenched-fist earnestness with a small but welcome pinch of irony—and this is what makes it feel vital in a way that a lot of recent guitar-based music is not. \"Do you like rock'n'roll music?\" Butler asks in a mock-Elvis shudder at the beginning of glam-rock earthquake \"Normal Person\". \"Cuz I don't know if I do…\" The only way to make a Big Rock Record in 2013 is to make one that is skeptical of what it means to be a Big Rock Record in 2013.\nOn their last tour, the Arcade Fire played for the first time in Haiti, the country where vocalist/multi-instrumentalist Régine Chassagne's parents were born. Their time there served as the inspiration for Reflektor; Butler spoke recently about the experience of playing for audiences who'd never heard many of the classic rock groups we take for granted, and instead \"connecting to people on a purely rhythmic, musical level…completely stripped of context.\" You can hear the Caribbean influence in Reflektor's emphasis on kinetic rhythms and deep grooves, but also in its somewhat irreverent attitude towards Anglo rock history. Reflektor is at once nostalgic for—its sense of sprawl feels like a throwback to the heyday of AOR—and iconoclastic about the past. It sounds like it has ingested a bunch of the great art-rock records you're \"supposed\" to learn to appreciate in your formative listening years—Low, Remain in Light, Exile on Main Street, The White Album, Here Come the Warm Jets— and thrown them into the fire, in an attempt to make new shapes from the smoke.\nReflektor's sound is lush and imaginative, but never in a way that suffocates you with the fumes of its polish. It's limber and loose, as though the songs were performed live; the arrangements breathe, seethe, and sweat. As their detractors will be quick to point out, Arcade Fire's greatest crime in the past has been sometimes coming off too stately and self-serious (The Suburbs in particular had a buttoned-up quality that failed to capture the frenzied energy of their live shows), but on the first half of Reflektor they often feel like they're deflating their own sense of grandeur. It's nice to hear a band that showed up on the scene quite literally dressed for a funeral now sounding like they're having (at least a little) fun.\nGoofy asides, unexpected left-turns, and tiny imperfections bring these songs to life: Check the odd, muttered phrases scattered throughout the intros, the parts on \"Normal Person\" when Tim Kingsbury's high E string seems to get clipped by the fretboard, or, maybe most thrillingly, the tempo fake-outs in \"Here Comes the Night Time\". That song, one of the album's best, begins with a celebratory Carnival beat, but then—the sonic equivalent to the tricks they've been playing in recent concerts and TV performances—suddenly switches to a slower, dub-inflected pace. There's a charming scrappiness to that moment as the band reorients to the rhythm, like a marching band suddenly realizing they're going the wrong way and trying, calamitously, to turn around.\nThere's always been a physicality about the Arcade Fire's sound—we're talking, after all, about a band whose members used to find it necessary to wear helmets on stage—but the rhythm section has never popped on one of their albums the way it does here. That emphasis has Murphy's stamp all over it (Butler says they all learned an important lesson early in the recording: \"If you can get James tapping his foot, you know you're on the right track\"), and so do the punched-up backing vocals. This is the first Arcade Fire album on which Chassagne doesn't sing lead, but her crisp, smartly arranged harmonies on songs like \"Reflektor\", \"It's Never Over (Oh Orpheus)\", and \"Joan of Arc\" make her a major presence. (Same goes for Colin Stetson, who did the album's horn arrangements and whose uneasy bass sax is the title track's secret weapon.) Even Reflektor's most straightforward pop songs like \"Joan of Arc\" and \"We Exist\" are fractured and haunted, reminiscent of the way Achtung Baby summoned the ghosts that had always been dormant in U2. When people talk about Murphy's production on Reflektor, the Eno comparisons will be obvious, unavoidable, and earned.\nReflektor unfolds over two discs, and which you prefer will depend on how many packets of earnest magnificence you take in your Arcade Fire. Disc 1 is raw and grounded; Disc 2 is airier, more cosmic, and a little less self-aware. The record's most divisive song is the second half's centerpiece, \"Awful Sound (Oh Eurydice)\", which—Julie Taymor style—aims to be nothing less than all the Beatles songs at once (\"Hey Jude\" and \"Revolution 9\" included). It inevitably falls short, but it's hard not to admire the effort. Lyrically if not sonically, the album's weakest link is the slinky \"Porno\", whose heavy-handed lyrics (\"Take the make-up off your eyes…Little boys with their porno/ They don't know what we know\") feel a bit too much like bleeding-heart teenage poetry. And yet, even if the shoulda-been-B-side \"Porno\" feels like a lapse in judgment, it springs from the same source that helps the band continue to be so vital. Arcade Fire are eternal, defiantly emotive teenagers, and that's what kept them sounding like genuine underdogs even as they've become one of the biggest bands in the world. Nearly a decade after Funeral, Butler still sings like everything is at stake. For this band, growing up has not meant cooling the flames so much as beckoning them higher. The figures at the center of the Side 2 suite of \"Awful Sound (Oh Eurydice)\" and the wonderfully Cocteau-glacial \"It's Never Over (Oh Orpheus)\" are not the Springsteenian everypeople of Funeral and Neon Bible, but instead the star-crossed lovers in a Greek myth.\nAnd yet, even on Disc 2 it's hard to shake the feeling that Orpheus and Eurydice are just the B-plot; the great love story on Reflektor is the one between music and listener. With its clipped snippets of airwave chatter (the BBC's Jonathan Ross makes a cameo), warped VHS hum, and retro-luminosity that nods to a time when synthesizers connoted un-jaded wonder and revelation, Reflektor is designed to be an homage to the many ways music is transmitted, discovered, and incorporated into people's lives. Chassagne has said that her earliest and most stirring musical memories were \"listening to [her] neighbor's music, the sounds coming through the walls\" and then trying to replicate them on piano; in the same interview, the Texas-born Butler spoke similarly about U2's (much maligned) Pop Mart tour. Reflektor's scope is vast enough that it speaks to both of these experiences—and to our own. In the end, it doesn't feel like a critique of this screen-glazed moment so much as a validation of it. They've given us something in the present tense that, these days, feels depressingly unfashionable: An Event—an album that dares to be great, and remarkably succeeds.\n", "Arcade Fire_The Suburbs (Deluxe)": "No Review", "Arcade Fire_The Suburbs": "Arcade Fire never aim for anything less than grand statements. That quality has played a huge role in making them very, very popular; it's also their greatest weakness. Funeral was wracked with agony and grief, but what made it one of the transcendent records of the 2000s was that it avoided easy answers. It proposed that the fight of our lives is just that, a fight, but a winnable one. But when they turned that same all-or-nothing intensity outward on Neon Bible, otherwise propulsive and elegant songs were sometimes bogged down by overblown arrangements or pedantic political statements. You'd figure an album bluntly called The Suburbs that focuses on The Way We Live might repeat some of Neon Bible's worst tendencies. Instead, it's a satisfying return to form-- proof that Arcade Fire can still make grand statements without sounding like they're carrying the weight of the world.\nThe metrics of The Suburbs are misleading: At 16 tracks, including interludes and multi-part songs, it might seem like Arcade Fire are shooting for their Sandinista!, Kiss Me, Kiss Me, Kiss Me, or Sign O' The Times-- a band at the peak of their powers reacting against the walls closing in by blowing everything up and trying anything. But the album actually plays out more like Bruce Springsteen's The River, a generously paced collection of meditations on familial responsibility, private disappointments, and fleeting youth, much of which takes place in moving vehicles*.* It also reintroduces much-needed levity to an act that can be overbearingly self-serious. On the deceptively chipper chamber pop of \"Rococo\", Win Butler borders on patronizing, evoking Nirvana's \"In Bloom\" and using the title word as a sword to skewer an easy target: the hipster more concerned with following trends than locating a genuine understanding in the world around him. But the point is that Butler values directness and truth, and throughout The Suburbs, what he lacks in poetry, he makes up for with honesty.\nThere's a tension between the uneasily resolving chords and lightfooted piano shuffle on the title track, as Butler sings in a restrained falsetto: \"Sometimes I can't believe it/ I'm moving past the feeling.\" As The Suburbs plays out, that \"feeling\" is one that lived on Funeral and is dying here. The initial fantasy of Funeral was escaping the neighborhood, dancing beneath the police lights, and living on misbehavior. The Suburbs can be seen as the update decades later, with those same kids having kids of their own, and moving back to and struggling in the same neighborhoods.\nThe heavy-handedness that marred some of Neon Bible mostly resulted from Butler's warning us of destruction caused by the lies of authority figures-- shady cultural impresarios, corrupt church leaders, politicians all too eager to push the button. But what makes The Suburbs a more humane and empathetic record is that Butler and Régine Chassagne have come to terms with how the pain of our day-to-day lives more often results from the lies we tell ourselves. At the outset of \"We Used to Wait\", staccato, minor-key piano chords evoke anxiety. The song is a simple lament about the exhaustion from a relentless pace of life that demands everything immediately. But as Jeremy Gara's steady drums lift the piece into cathedral drama, it's obvious that there's a deeper concern than the antiquation of letter-writing. By the time the narrator finds himself with \"the lights cut out... left standing in the wilderness downtown,\" it's a sad reminder that giving up your dreams for a reliable job that pays your way and corrodes your soul isn't even a reliable option anymore. Soul-sucking work was at least once a dependably secure and profitable enterprise. Now what do we do?\nThe bulk of The Suburbs focuses on this quiet desperation borne of compounding the pain of wasting your time as an adult by romanticizing the wasted time of your youth. As bleak as the lyrics are, though, they're buoyed by the band's leanest, loosest songwriting yet. These songs are busy, but never overly complicated, subtly nudging at their boundaries while allowing wide lanes for Butler's perfectly memorable melodic turns. The framework is familiar: Arcade Fire's trademark of decorating AOR with orchestral fringe (\"Ready to Start\", \"Empty Room\"), sun-baked Harvest gold (\"Wasted Hours\", \"Suburban War\"), and in the record's highlights, pulsating electro (\"Half Light II [No Celebration]\", \"Sprawl II [Mountains Beyond Mountains]\").\nBut The Suburbs is a record that seeks to build, and it reaches a monumental peak at its closure. Both parts of \"Sprawl\" act like a conversation between lovers and a treatise on what makes Arcade Fire tick: Butler's despondence on \"Sprawl I (Flatland)\" matches the desolate atmosphere that surrounds him-- returning to a mall-spackled hometown is an admission of defeat. But as with their first two albums, the penultimate song towers over what came before: \"Sprawl II\" is an Arcade Fire song through and through, balancing a sort of defiance in the midst of crushing circumstance (\"These days, my life, I feel it has no purpose/ But late at night the feelings swim to the surface\"). It's a rare and thrilling example of the group stepping out of their musical comfort zone, an airy disco bounce evoking \"Heart of Glass\" that serves as further evidence of just how crucial the often underappreciated Chassagne is in tempering Butler's grimmer outlook.\nThat said, the relative concision of Funeral and Neon Bible didn't allow for a whole lot of wiggle room. And while it's somewhat heartening to hear something allowed to be a \"minor\" Arcade Fire song, they're still, well, minor. \"Month of May\" strains too much for a ragged punk glory while the folky, Neil Young-ish strummer \"Deep Blue\" doesn't develop its Kasparov vs. IBM metaphor into more than an afterthought. And as The Suburbs reaches its second half, there's certainly some thematic redundancy-- surely, there's already a drinking game revolving around Butler's use of \"the kids.\"\nThere's also the possibility that The Suburbs can be seen as a lesser Arcade Fire album if you mostly value rock music for its escapism. This is another 2010 example of a Boss-indebted band (see also: the National and Titus Andronicus) making epic outpourings of modern disillusionment and disappointment for people who can commiserate and return to fretting about their jobs and bank accounts once the house lights go up. But just because the concerns of The Suburbs are at times mundane, that makes them no less real. And that Arcade Fire can make such powerful art out of recognizing these moments makes our own existences feel worthy of documentation. By dropping Neon Bible's accusatory standpoint, The Suburbs delivers a life-affirming message similar to Funeral's: We're all in this together.\n", "Arcade Fire_The Suburbs (Deluxe Edition)": "No Review", "Arcade Fire_Neon Bible": "Sharing its title with a John Kennedy Toole novel, the Arcade Fire's second album is markedly different from its more cloistered predecessor: On Neon Bible, the band looks outward instead of inward, their concerns more worldly than familial, and their sound more malevolent than cathartic. Angry, embittered, and paranoid, but often generously empathetic in their points of view, they target the government, the church, the military, the entertainment industry, and even the basest instincts of the common man.\nWhile the group's us-against-the-world stance occasionally comes off as slightly self-righteous or reactionary, their scathingly critical perspective gives weight and direction to their nervy earnestness: If Funeral captured the enormity of personal pain, Neon Bible sounds large enough to take on the whole world. This is evident on the album's incantatory opener, \"Black Mirror\", whose title derives from a centuries-old device that supposedly foretold future events and allowed viewers supernatural insight the hearts of men. Here, the band holds that mirror up to the world and captures a malevolent reflection.\nFitting Neon Bible's more worldly concerns, the Arcade Fire have streamlined the raw, large sound of Funeral into something that achieves the same magnitudinous scale through more economical means. Propelled by inventive guitar work and Jeremy Gara's steady drums, the group pares back anything that might curb the controlled forward thrust of songs like \"Black Mirror\", \"Keep the Car Running\", or \"The Well and the Lighthouse\". These songs don't erupt, but gradually crescendo and intensify. Unlike the cathartic Funeral, Neon Bible operates on spring-loaded tension and measured release. As such, it could strike some listeners as a disappointing follow-up, but the record's mix of newfound discipline and passion will likely imbue it with a long shelf-life.\nOn most songs, the Arcade Fire achieve a headlong forward motion, bolstered by immense church organs and Calexico horns that underscore the angst of Butler's bitter, accusatory lyrics. Perhaps the most noticeable (and promising) development in the band's sound is the more prominent role of Régine Chassagne. If she once sounded studied or mannered, here her angelic soprano projects a tentative hopefulness, making her a capable foil for Win Butler's tense performance. Her contributions to \"(Antichrist Television Blues)\" and \"Black Wave\" sound like the vocal equivalent of her soaring string arrangements, co-written with Owen Pallet of Final Fantasy.\nThese changes aren't drastic, but they are significant, especially as they reveal new and interesting touchstones for the band's aesthetic. The influences most commonly associated with Funeral were Davids Byrne and Bowie, but on Neon Bible, it's Bruce Springsteen who appears not only in the wordy songs and aggressive shuffle, but in the compression of so many styles and sounds into one messy, exciting burst. \"Ocean of Noise\" shuffles furtively on a shoreline samba, due largely to Tim Kingsbury's bassline, while \"Bad Vibrations\", sung by Chassagne, blends girl-group and new wave performances into a darkly enticing whole. The band never compartmentalizes these styles or consigns them to separate songs, but allows them to blend freely.\nAlthough they've expanded their sound, the Arcade Fire's transition into extroversion isn't always smooth or graceful. Neon Bible is full of clunky lyrics, revealing Butler's tendency to overstate and sensationalize. His rhyme schemes are sometimes too deliberate and set-- and no one should be allowed to use the sort of faux-antiquated sentence construction that pops up in lines like \"I fell into the water black.\" \"Black Mirror\" features one of the record's worst offenders: \"Mirror mirror on the wall/ Show me where them bombs will fall.\" Butler's words, however, have always carried less meaning than the way he sings them and the sound in which his band envelops them, so whenever a line falls flat on Neon Bible, the music, always hurtling forward, picks it up and carries it along.\nLike many indie artists, the Arcade Fire work best in the album format, and Neon Bible runs on a different-- and in some ways more finely tuned-- mechanical system than its predecessor. It's a shapely work, gracefully building to fall away to build again, as the band sustains a mood that's both ominous and exhilarating. Even \"No Cars Go\", which originally appeared on their self-titled debut EP, sounds more powerful here than it did in its previous incarnation. As stand-alone tracks, these songs don't make as much sense, which partly explains why those early leaks were so uninspiring. The danger here is inaccessibility: There's only one natural entry point to Neon Bible, and it's \"Black Mirror\". Everything afterwards flows seamlessly from that song's low rumble and startling imagery-- until the final track.\nVenturing into the lyrical realm of Trent Reznor, album closer \"My Body Is a Cage\" seems too eager to wallow in the sort of pained melodrama that fuels the band's detractors. The real disappointment is that Neon Bible doesn't end with \"No Cars Go\", which easily achieves the release they artfully promise but playfully deny throughout the record's first nine tracks. Not only would it have ended the album on a more generous note, it would have made perfect thematic sense as a final invitation to escape.\nBut despite their conflictedness , the Arcade Fire remain firmly rooted in the here and now. And even as press coverage and fan obsession suggest that the world is making a place for them, the band is still looking for a way to understand that world, and to see it for what it really is-- or at least as it appears in the distorted mirror they hold to it.\n", "Arcade Fire_Funeral": "Mass Gothic’s second album begins and ends with a window. At first, the window is dark; by the end of the record, it’s merely big. Presumably the sun has come up. Between “Dark Window” and “Big Window,” this project from Hooray for Earth’s Noel Heroux exudes so much bombast as to become exhausting. While the first Mass Gothic record was essentially a Heroux solo outing, I’ve Tortured You Long Enough loops in his wife, Jessica Zambri, who co-wrote the album and sings throughout. The couple adopts a dynamic reminiscent of Win Butler and Régine Chassagne—at many points, I’ve Tortured You betrays its deep desire to be an early Arcade Fire release—but their songwriting choices don't support their incessant swings for the rafters.\nThe album introduces itself with a rhythmic figure pilfered from the Jesus and Mary Chain’s “Just Like Honey,” an homage Heroux already paid on Hooray for Earth’s “Last Minute,” from 2011’s True Loves. The Scottish band has clearly colored his approach to songwriting and production: Their haze and grit can be heard throughout his projects, and with Zambri he continues to work in their retro mold. I’ve Tortured You has a delightfully textured production style that blurs guitars, drums, and synths together like a painted background, allowing the singers’ voices to vault to the top of the mix. But Psychocandy balanced its blunt fuzz with a light touch. “Just Like Honey” is both noisy and delicate. I’ve Tortured You loses that nuance, blowing out its engines at every turn.\nPower ballads generally work because they couple their enthusiasm with a certain disarming strangeness. The enthusiasm has to be grounded in something new, something that justifies the excitement. Arcade Fire’s lyrics on Funeral and Neon Bible conjured up imagery of primitivist utopias, of love alchemizing the mind. More recently, Lorde’s compositional whirlwind “Green Light” swirled together great white sharks and light-up dance floors. The words earned their delivery. Heroux and Zambri use a similarly dramatic vocal style to Butler, Chassagne, and Lorde, but their lyrics weigh down their songs. Their couplets are either trite, like “While you lift me in the air/There’s time only to love you,” from “Call Me,” or baffling: “Undersea where the viper glows/And the tragedy isn’t one I know,” Zambri narrates on “The Goad.” So a snake bioluminesces and nothing happens.\nI’ve Tortured You never lets up on its fist-in-the-air rock eruptions. No small acoustic numbers punctuate the record; there is no time to regroup. Even within songs, Heroux and Zambri follow safe, predictable progressions. Multiple tracks reiterate a single vocal melody for their entire duration: no verse, no chorus, just the same stanza over and over. By the end, the window imagery that frames the album feels like a self-conscious metaphor. “I am looking out there/Big window,” Zambri repeats on closer “Big Window.” She does not tell us what she sees. Over pounding drums and roiling electric guitar, she issues the record’s final lyric in a voice that sounds like it wants to rouse stadiums: “It never happened.” The “it” has no antecedent. Again, we’re left with a blank space where emotion should be.\n", "TV on the Radio_Seeds": "The cheap Williamsburg loft that Tunde Adebimpe and Dave Sitek rented with day-job paychecks while making their first 4-track recordings is now an expensive condo with a wine shop built into it. TV on the Radio, the band that formed there with help from friends in other nearby noisy bands—the Yeah Yeah Yeahs and Liars—make music that sounds a lot more expensive more than a decade later, but have otherwise moved more toward accessibility than away from it. That’s how music works differently from the market for the real estate where it’s made: while Brooklyn’s been gentrified into the walled-off backdrop for Lena Dunham’s mumblecore Marlo Thomas performance, infinitely more people will have access to TV on the Radio’s fifth album Seeds than the band’s 2004 Touch & Go debut, exactly because more money has been invested into it. Thankfully, for longtime fans and new listeners alike, though the music might sound pricier than ever, the basic architecture hasn’t really changed at all.\nOpening song \"Quartz\" demonstrates that from a production standpoint, the group hasn’t lost its unique ability to conjure a surreal, soulful dread. Everything starts in medias res, as if we’ve been dropped into the middle of a séance in the desert. The handclaps, moaning vocals, and what sounds like a South Asian percussion instrument (it’s actually a loop of Sitek dropping a drumstick onto piano strings) sound like a glossier version of \"Satellite\" and \"Staring at the Sun\" from 2003’s Young Liars EP, Sitek and Adebimpe still merging lessons drawn from the European-derived NYC avant-garde and centuries of African-American church music. When Adebimpe’s powerhouse vocal comes in, it’s instantly familiar, both as a reminder of the absolute best that the shrunken state of post-millennial rock can produce and the fact that that voice—that voice—can still turn even the most interpersonal utterances into sentiments of galactic force.\nEven though it’s meant to signify moving on from a romantic relationship, when Adebimpe keeps rolling out the phrase \"but I should really give it up sometime\" it’s hard not to remember that the past several years for TV on the Radio—as they came down from the impossible peak of Return to Cookie Mountain—have been marked by different forms of loss. Most crucially, longtime bassist Gerard Smith passed away from cancer days after Nine Types of Light was released—a huge blow for a tight-knit band. The group also broke from its label Interscope, which pushed Mountain in front of the largest possible audience (this is its first album on legendary '70s prog-rock haven Harvest). Light also marked the point where TV on the Radio more or less stopped incorporating explicit politics in their lyrics—observational and ironic message tracks like \"Caffeinated Consciousness\" and \"No Future Shock\" (\"do the ‘no future’\") felt like an extended ¯\\(ツ)/¯ after the gospel-powered hopefulness of 2008’s \"Golden Age\", which for more than a few of us was the unofficial theme song of the sadly brief window of hope and change following Obama’s inauguration.\nSo while TV on the Radio peaked from 2006 to 2008, the last two albums feel less like an artistic decline and more like a shift in focus and a lowering of stakes. The lead single from Seeds, accompanied by a video of Paul Reubens doing a Speed Racer knockoff, was \"Happy Idiot\", another song superficially about getting over a relationship that can easily double as an strategy for negotiating an existence over which one’s lost all control. Like much of Seeds as well as its predecessor, \"Idiot\" embraces rhythms derived from the electronic end of the dance music spectrum, and does so as easily as they incorporated John Zorn skronk and Prince synth funk in the past. Like their best songs, \"Idiot\" works because it balances simple catchiness with urgency and anxiety, like their post-punk forebears taught them: the piston-pumping rhythm section is counterposed against Adebimpe’s tenor, which floats in a dazed murmur for the vocals and upshifts to nervous falsetto for the chorus. This is a Sitek production, of course, and underneath the lustrous exterior he layers a subtle, high-pitched synth drone (a cousin to the menacing washes of distorted guitar that distinguished the band’s early music), which gives the song a sense of creeping dread nearly at an unconscious level.\nAfter Cookie Mountain, as with the followups to so many great records on which a restless band seeks to conquer new territory, Sitek started cleaning up the band’s sound, doing away with its trademark siren-like clamor after falling for the pristine production of \"Eyes Without a Face\" (listen to that song again and then come back to Light and Seeds. You’ll hear them differently). What’s quietly happened since then is that TV on the Radio have shed the Best Band in the World expectations and simply become a really good anthemic rock band. Check the segue from the neon sizzle of the Gary Numan/Depeche Mode burner \"Careful You\" into the open-hearted jangle boogie of \"Could You\", which achieves the ultra-rare feat of writing a '90s Sugar chorus as good as the ones Bob Mould came up with, or the perfectly-executed Ramones bop that introduces late-album track \"Lazerray\". It sounds simple, but shockingly few bands at TV on the Radio's level are able to do it without sounding corny. So while they've long segued from fin-de-siecle Brooklyn to edge-of-the-continent Silver Lake, losing more than they’ve gained along the way, TV on the Radio are still capable of conquering big stages and broad sonic territory with the kind of precision and power for which their increasingly desperate older contemporaries need to rely on expensive stunts.\n", "TV on the Radio_Nine Types of Light": "On paper, TV on the Radio's recent accomplishments look like the work of textbook careerists. They left renowned indie label Touch and Go to join Interscope. Their major-label debut boasted a cameo from David Bowie. Singer Tunde Adebimpe starred opposite Anne Hathaway in a Jonathan Demme-directed drama. Guitarist/producer Dave Sitek made a record with Scarlett Johansson and is now possibly joining Jane's Addiction. Of course, one listen to any TV on the Radio album quickly dispels any notion of calculated opportunism. Even as their art-rock soul has blossomed out of their home-recording roots into something bigger and bolder, their music is still fraught with a simmering unease; even the dancefloor-ready maneuvers of 2008's Dear Science exuded a jittery, restless energy that was as tense as it was celebratory.\nHowever, as Nine Types of Light suggests, perhaps they just needed to get out of Brooklyn. The new album marks two significant changes in TVOTR's methodology: It was made in the wake of a one-year hiatus following six years of non-stop recording and touring; and it was recorded in Los Angeles, where Sitek has been steadily building his celebrity clientele list over the past few years. Both factors seem to have influenced the sound and feel of the album: Nine Types of Light is unquestionably TV on the Radio's most patient, positive recording to date, taking its cues as much from Dear Science's serene ballads (\"Family Tree\", \"Love Dog\") as its brassy workouts. Each of the band's albums has opted for a tone-setting opening salvo, and mission statements don't come more concise and clear-headed than Tunde Adebimpe's ecstatic, falsettoed hook on Nine Types' first song, \"Second Song\": \"Every lover on a mission/ Shift your known position/ Into the light.\"\nLove songs are, of course, nothing new for TV on the Radio, but they're usually cast against the grim backdrop of life during wartime: Desperate Youth, Bloodthirsty Babes' doo-wop serenade \"Ambulance\" spoke of emotional commitment using the language of hospital care; Return to Cookie Mountain's \"Province\" effectively equated a declaration of love with an act of radicalism. On Nine Types of Light, however, there seems to be a more concerted effort on the band's part to not let external pressures sully their inner spirit: Set to steady shuffle beats, \"Will Do\" and \"You\" are impassioned, open-hearted addresses delivered free of any political context, while Kyp Malone's \"Keep Your Heart\" feels like a riposte to Cookie Mountain's defeatist \"I was a lover before this war\" refrain, promising instead to \"keep your heart, if the world all falls apart.\" Malone's stutter-funk standout \"No Future Shock\" takes this don't-let-the-bastards-get-you-down sentiment to more delightfully absurd extremes, channeling pervasive anxieties over everything from global economic collapse to invasive airport security into a new dance move (\"Do the no future! Do the no future!\").\nComing four songs in, \"No Future Shock\" at first feels like an anomaly on an album that frontloads its more elegiac material; the notion that Nine Types is a more subdued, comedown counterpoint to Dear Science is further posited by Adebimpe's six-minute, mid-album centerpiece, \"Killer Crane\", a pretty, proggy pastorale that gently ebbs and flows with flourishes of strings, piano, banjo, and mellotron. But the album's second half is more in step with Dear Science's manic swagger; though mid-tempo exercises \"New Cannonball Blues\" and \"Forgotten\" never catch fire to the same degree (even with the late-song intrusion of the horn section), \"Repetition\" is an exhilarating display of Adibempe and Malone's motor-mouthed repartee set to a krautrock thrust. And as weird as it was to see Liars' Angus Andrew faithfully singing INXS' \"Guns in the Sky\" in a promo vid for Beck's Record Club last year, Nine Types' massive, arena-rattling closer, \"Caffeinated Consciousness\" proves that song must hold a special place in the hearts of Brooklyn's post-punk class of 2002.\nIn the past, TV on the Radio have tried to undercut their more rockist ambitions with dissonant textures and queasy atmospherics, or lace their prettiest ballads with subversively ominous lyrics. But Nine Types of Light shows how TV on the Radio's transmissions can be just as effective and affecting when delivered free of static and noise.\n", "TV on the Radio_Nine Types of Light (Deluxe Version)": "No Review", "TV on the Radio_Nine Types of Light (Deluxe)": "No Review", "TV on the Radio_Dear Science (Bonus Track Version)": "No Review", "TV on the Radio_Dear Science": "Dear Science, TV on the Radio's follow-up to 2006's Return to Cookie Mountain-- a dense and textural album with an optimistic core-- is catchier, but thornier than its predecessor. Musically, it's an instant grabber: Handclaps crack like fireworks. TVOTR's horns, courtesy of the Antibalas Afrobeat Orchestra, sound punchier and brighter than ever before. Vocalists Tunde Adebimpe and guitarist/singer Kyp Malone thrive as dual frontmen: They're sexy when they're angry, and even sexier when they're not. And David Sitek's production is shiny and urgent, while his harsher synths and doo-dads hang back like a commentary track.\nBut making popular music sits uneasily with this art-rock crew, and so although this is TV on the Radio's slickest, catchiest, and potentially most popular LP, it nevertheless reeks with dread. Lyrics about the dead, death, and dying litter the album from its second line onward. Songs with sentimental titles carry the most dire lyrics-- like \"Family Tree\", a gorgeous ballad about forbidden love whose titular plant becomes a gallows. And the lyrics to \"Red Dress\" are almost childishly pouty. Assuming the role of industry-bred stars, TVOTR complain that instead of waving collective fists in the air, listeners are merely getting down to their Prince-like guitars and brash brass: \"They got you tamed, and they got me tamed.\" But the self-hatred makes it engaging: \"I'm living a life not worth dying for.\"\nThe promise of dancing away all your troubles hangs over every sweaty note, until TVOTR happily yank it away. On \"Dancing Choose\", the big chorus and synth power-chords interrupt the funk and double-time vocals to remind us this is a rock band, prone to making big statements. See also \"DLZ\", a half-rap, half-primal scream from Adebimpe that sounds like it's aimed at every figure of power in the world. But how do they follow that? With a big brash song about fucking. Anthemic horns and parade drums treat the whole thing like a football pep rally, \"I'm gonna take you, I'm gonna shake you, I'm gonna make you cum.\" That could be their most transparent lyric yet.\n\"Shout Me Out\" is the only cut that reveals any unselfconscious joy. With a chorus that borrows well from Bob Dylan's \"A Hard Rain's A-Gonna Fall\", it comes the closest to the raw sound of their past works: Repetitive guitar and a chiming synth loop introduce Adebimpe singing a gentle verse, as the song builds to a fantastic, frenetic release and the electric guitar crackles and rails along. This is familiar territory for them-- and they get out fast.\nYes, this is shit-hot thrilling music. But it's also brainy and ambivalent, and more engaging for it. TV on the Radio remain a true Event Band, and the sign o' the times they capture here isn't audacious hope, or fierce revolution: it's confusion. They're the house band for a country that has no idea what'll hit it next, and Dear Science is a jagged landscape of self-doubt, Bush-hate, and future-fear. And once in a while, you still get some of their optimism. Take the first single and the album's fulcrum, \"Golden Age\", which ice skates to heaven on billowing horns, sweet swirling strings, a video that stars harmless dancing cops, and Malone's falsetto. Malone has said it's about \"utopia.\" And he sings like he still believes in it. But he has nothing to back him up but the beat.\n", "TV on the Radio_Return To Cookie Mountain": "Often when we say a record has \"atmosphere,\" we mean it as a put-down. From Sgt. Pepper's to the present, a record's sonic appeal-- the effects, the mood, the spaces between the notes-- is inextricable from how it hits us. But when an artist pushes atmosphere in place of songs, it's frequently thought of as a crutch. Most listeners don't trust a mood to grab their hearts the way they trust, say, a human voice; nobody counts on production to deliver the \"money note.\"\nWhen I try to explain TV on the Radio to people who aren't into them, the first thing on the checklist is singer Tunde Adebimpe, a stoic romantic who falters but never whimpers. He's got about the best set of pipes in indie rock, yet on Return to Cookie Mountain his greatest strength lies in how well he stands back and blends in-- with the throatier Kyp Malone, guest singers including David Bowie, and, especially, with the atmosphere evoked by producer and noisemaker David Sitek. As the two founding members, Adebimpe and Sitek fit together like Jagger and Richards. But where the two Rolling Stones projected snarling sex, these guys express... what?\nIn the original version of Return to Cookie Mountain that leaked this spring-- the one that kicked off at full throttle with \"Wolf Like Me\"-- they sounded like victory. With that cut up front, you knew this was the great leap forward for which their last two records paved the way-- and when I say three records, I'm counting their scattershot sketchbook OK Calculator, which caught the band at its most \"Hey, what can I do with this four-track?\" They always claim they'd rather keep messing around with new ideas than settle down and crank out the hits that are at their fingertips, which is one reason 2004's Desperate Youth, Bloodthirsty Babes felt more eclectic than excellent. (In retrospect, the other reason is that they were still using drum machines.) But this time, maybe they'd changed their minds.\nBut before Return to Cookie Mountain became their major label debut, its tracklist was reshuffled. Now it leads off with the fascinating \"I Was a Lover\", a sympathy card that carries the most emotional sample on the record-- a bellow like the sound of a sad elephant, which fits right in with the defeated verse. It takes skill to craft a tone that people can feel sorry for; maybe there is a money note locked in that pedal crouching under Sitek's shoe. But other times, the noise evokes an orchestra, or a rockslide. Abstract and electronic textures roll over acoustic sources-- bowed upright bass, sitars, flutes, backward wind chimes-- to reach a perfect consistency, all the way through to the closer, \"Wash the Day Away\", where white noise rises and swallows them all. But not a moment too soon: not only is the mix stellar (if a little too biased away from the vocals), but once you get used to the new setlist, the pacing is perfect as well.\nThe band cycles up like a centrifuge. Vocals spin on \"Dirty Whirl\" like wooden figurines on a Swiss cuckoo clock, while a shimmering piano figure chimes across \"Province\". Like their first albums, the songs build on loops, grooves, and drones. They feel familiar, but they've never sounded this good-- or this thick. Even the voices cascade on top of each other, which obscures much of the lyrics. Nothing can cut through except the sharp and vigorous rhythm section. Check out the way the air catches in Adebimpe's throat on \"A Method\", then shakes loose when Jaleel Bunton bursts in like a drum corps waiting in the parking lot for the parade to start.\nBut what's their message? They're not here to rock-- they use too many loops, too much repetition, and too little chaos. They can do the community-drum-circle thing, but they're too slick to try it more than once (\"Let the Devil In\"). And even Adebimpe's voice has never sunk this far into the music; we don't even get an a capella feature this time, because this isn't an album about standing out. He's still a failed romantic, a social conscience, a charmer, and a distant voyeur; but with every album he becomes less of a \"persona\" and more of a regular person.\nMaybe that's why this album has such an incredible pull: It doesn't make an atmosphere so much as a space to spend time in, and Adebimpe doesn't become a narrator so much as a witness. We sidle up into his head and watch through his eyes the tyrants, the druggies, the cocky lovers, the losers, and those beautiful fools who still surrender to lines like \"Love is the province of the brave.\" And TV on the Radio are standing in the center, watching it all go by again, and again, and again.\n", "TV on the Radio_Desperate Youth": "The word I keep hearing for this band is \"soulless.\" It's true that the Young Liars EP had a metallic sheen, a mechanical repetitiveness that both boosted and encased the silver-throated vocals of Tunde Adebimpe. The songs were full of distance and voyeurism, as if Adebimpe was stuck on his own satellite, watching lovers from afar. When he got close to a woman, on the stunning soliloquy \"Blind\", he couldn't close the deal without giving up the truth: \"My love is a suckerbet.\" But that ain't soulless.\nAnother description that never rang true was the comparison of Adebimpe's voice to Peter Gabriel-- a decent match in timbre, but Adebimpe's such a different person that I just can't hear the likeness. This isn't a man who would go on stage dressed like a flower. Instead, Adebimpe sounds like a superhero-- a troubled, Batman-style superhero, who can rescue the girl but frets over whether to take the grateful French kiss when they hit safe ground. Nobody with his talents and forthrightness could also have insecurities, yet that was what the lyrics made us believe. His vocals resonate because of his identity: He towers over most vocalists, not just for his skill, but because he's so transparent behind it.\nThe band's full-length debut may be one of the most eagerly awaited records of the year. Until now, TV on the Radio have only flashed their talent: David Andrew Sitek's chugging beats and harsh grey textures, Adebimpe's voice, and new member Kyp Malone on vocals, guitar, and even more loops. So the final product, Desperate Youths, Blood Thirsty Babes, can't help but sound like a curveball when held against the flawless Young Liars, the monumental expectations, and the fact that they're still indulging their growing pains.\nThe record starts strong: On opener \"The Wrong Way\", the sound of a sidewalk sax blower is interrupted off the beat by a dark chugging loop, a sound that resembles refrigerators being pushed down a hole-- but also resembles human feet stomping and hands clapping. Funk and gospel enter the palette as Malone and Adebimpe harmonize on lyrics that grapple with race. TV on the Radio don't base their work on the fact that they're an interracial, mainly African-American band; unlike Living Colour or the 2 Tone bands in the 80s, there's no reason to peg them as a \"black rock band\" more than a rock band that happens to have black members. So when race comes up, they use it for questions more than statements. On \"The Wrong Way\", they pick up and dismiss a series of black icons and stereotypes, from the \"soft shoe\" entertainer or the gentle \"magic nigger\" in the movies, to the \"fist up\" protesters and \"new negro politician\"; but they're also trying out the roles, as if assessing where they stand or questioning whether they could end up \"playin' the whore.\" If they have a message, it's mostly about themselves: TV on the Radio reflect the world they're in, but they'll never say they speak for it.\nThe album repeats one track from the EP, \"Staring at the Sun\"-- the catchiest but least introspective track on that album-- and that sets the path for the band's new style, which is alternately driving and repetitious. The guitar parts are almost as static as the beats, and no track develops with the subtlety of, say, Young Liars' \"Blind\". The loops and settings run out of ideas by the end of the record; \"Don't Love You\" chugs ahead with no progress, making the next song, \"Bomb Yourself\", sound more plodding than it actually is. Even \"Wear You Out\" seems limited when the swarthy opening picks up horns, and then plateaus right away. It isn't a climax so much as proof of how cold those textures can become.\nThe last third is a tough slog. But track by track, the album's songwriting is tight and often beautiful, like the harmonies on \"King Eternal\" and \"Poppy\" that scrape the sky and even overshadow the graceful a cappella \"Ambulance\". And the lyrics are exceptional, with not-too-cryptic images that are both surreal and frank: \"All men condemned by men to die/ Damned by blind bitch in hallowed halls\" is an intriguing image of the justice system, but to follow it with \"Cover your balls/ 'Cause we swing kung fu\" is truly the way to greatness.\nThe biggest improvement here is the addition of Malone. Is it even right for one band to hog two great vocalists, two singers with real personalities and no stylistic self-caging, at a time when most people just struggle to follow a template? Malone creeps through the high registers and whispers the heat that Adebimpe won't release; the two of them sound great as co-leads. My only objection is that the record sounds less intimate than when Adebimpe has the mike to himself.\nThe Young Liars EP was as fully realized as all the critics suggested, yet now, TV on the Radio sound like a work in progress. Still, Desperate Youth, Blood Thirsty Babes shows more strengths than mistakes. The band's best work comes out of tension, out of a dramatic setting or the sparking of elements against each other-- multi-cultures smashed together, men harnessing their voices to machines, the excitement of that saxophone cutting against a sludge-loop at the start of the record. They wrestle with these tensions instead of letting them explode, they hammer out loops and sounds as they collaborate on music that's rent with conflict. Nobody knows where it'll end, but we're lucky to get to watch.\n", "TV on the Radio_Blood Thirsty Babes": "The word I keep hearing for this band is \"soulless.\" It's true that the Young Liars EP had a metallic sheen, a mechanical repetitiveness that both boosted and encased the silver-throated vocals of Tunde Adebimpe. The songs were full of distance and voyeurism, as if Adebimpe was stuck on his own satellite, watching lovers from afar. When he got close to a woman, on the stunning soliloquy \"Blind\", he couldn't close the deal without giving up the truth: \"My love is a suckerbet.\" But that ain't soulless.\nAnother description that never rang true was the comparison of Adebimpe's voice to Peter Gabriel-- a decent match in timbre, but Adebimpe's such a different person that I just can't hear the likeness. This isn't a man who would go on stage dressed like a flower. Instead, Adebimpe sounds like a superhero-- a troubled, Batman-style superhero, who can rescue the girl but frets over whether to take the grateful French kiss when they hit safe ground. Nobody with his talents and forthrightness could also have insecurities, yet that was what the lyrics made us believe. His vocals resonate because of his identity: He towers over most vocalists, not just for his skill, but because he's so transparent behind it.\nThe band's full-length debut may be one of the most eagerly awaited records of the year. Until now, TV on the Radio have only flashed their talent: David Andrew Sitek's chugging beats and harsh grey textures, Adebimpe's voice, and new member Kyp Malone on vocals, guitar, and even more loops. So the final product, Desperate Youths, Blood Thirsty Babes, can't help but sound like a curveball when held against the flawless Young Liars, the monumental expectations, and the fact that they're still indulging their growing pains.\nThe record starts strong: On opener \"The Wrong Way\", the sound of a sidewalk sax blower is interrupted off the beat by a dark chugging loop, a sound that resembles refrigerators being pushed down a hole-- but also resembles human feet stomping and hands clapping. Funk and gospel enter the palette as Malone and Adebimpe harmonize on lyrics that grapple with race. TV on the Radio don't base their work on the fact that they're an interracial, mainly African-American band; unlike Living Colour or the 2 Tone bands in the 80s, there's no reason to peg them as a \"black rock band\" more than a rock band that happens to have black members. So when race comes up, they use it for questions more than statements. On \"The Wrong Way\", they pick up and dismiss a series of black icons and stereotypes, from the \"soft shoe\" entertainer or the gentle \"magic nigger\" in the movies, to the \"fist up\" protesters and \"new negro politician\"; but they're also trying out the roles, as if assessing where they stand or questioning whether they could end up \"playin' the whore.\" If they have a message, it's mostly about themselves: TV on the Radio reflect the world they're in, but they'll never say they speak for it.\nThe album repeats one track from the EP, \"Staring at the Sun\"-- the catchiest but least introspective track on that album-- and that sets the path for the band's new style, which is alternately driving and repetitious. The guitar parts are almost as static as the beats, and no track develops with the subtlety of, say, Young Liars' \"Blind\". The loops and settings run out of ideas by the end of the record; \"Don't Love You\" chugs ahead with no progress, making the next song, \"Bomb Yourself\", sound more plodding than it actually is. Even \"Wear You Out\" seems limited when the swarthy opening picks up horns, and then plateaus right away. It isn't a climax so much as proof of how cold those textures can become.\nThe last third is a tough slog. But track by track, the album's songwriting is tight and often beautiful, like the harmonies on \"King Eternal\" and \"Poppy\" that scrape the sky and even overshadow the graceful a cappella \"Ambulance\". And the lyrics are exceptional, with not-too-cryptic images that are both surreal and frank: \"All men condemned by men to die/ Damned by blind bitch in hallowed halls\" is an intriguing image of the justice system, but to follow it with \"Cover your balls/ 'Cause we swing kung fu\" is truly the way to greatness.\nThe biggest improvement here is the addition of Malone. Is it even right for one band to hog two great vocalists, two singers with real personalities and no stylistic self-caging, at a time when most people just struggle to follow a template? Malone creeps through the high registers and whispers the heat that Adebimpe won't release; the two of them sound great as co-leads. My only objection is that the record sounds less intimate than when Adebimpe has the mike to himself.\nThe Young Liars EP was as fully realized as all the critics suggested, yet now, TV on the Radio sound like a work in progress. Still, Desperate Youth, Blood Thirsty Babes shows more strengths than mistakes. The band's best work comes out of tension, out of a dramatic setting or the sparking of elements against each other-- multi-cultures smashed together, men harnessing their voices to machines, the excitement of that saxophone cutting against a sludge-loop at the start of the record. They wrestle with these tensions instead of letting them explode, they hammer out loops and sounds as they collaborate on music that's rent with conflict. Nobody knows where it'll end, but we're lucky to get to watch.\n"}